--[[
下一步：

--------1.logger
-------2.string
---- ui图层
--- ui相机 两个相机的问题
---.场景切换 stage
----.ab资源包的内存中 卸载加载
-- 6.ab包的依赖关系 怎么搞
-- 6.场景的ab包资源怎么加载
----场景资源再场景切换的时候 
-----
------7.lua层事件的实现
-----8.dotween系统的导入

----9.射线相关的东西
------10.多个场景的管理 直接加上去
------- 定时器

11.View层的 界面弹出顺序
12.对象池相关脚本
13.检测文件大小写的 cs脚本
14.scrollview 优化的lua交互
15.protect 阴影部分
16.spine
17.新手引导
18.红点系统
19.时间工具类


1.socket相关的
2.服务器怎么整
3.断线重连 等


-----------1.日志系统需要再改  记录到log.txt脚本中

1.声音相关的管理
2.视频播放 


-------1.update 函数 传递到lua层
-----------2.计时器（安全的计时器）
3.固定种子 取随机数相关

最后搞这个

1.3d相关的脚本  Avatar父类脚本
2. 骨骼合批等
3.  贴图

3d动作相关（稍微底层的）

Unity常用的 优化技术  场景等的东西
]]





--可以尝试的东西
-- 俄罗斯方块
-- 双截龙
-- 魂斗罗
-- 算法
 